Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24FJ128DA210.h
#define _G1ACTDA_ACTPIX1_POSITION                0x00000001
#define _G1ACTDA_ACTPIX1_MASK                    0x00000002
#define _G1ACTDA_ACTPIX1_LENGTH                  0x00000001

#define _G1ACTDA_ACTPIX2_POSITION                0x00000002
#define _G1ACTDA_ACTPIX2_MASK                    0x00000004
#define _G1ACTDA_ACTPIX2_LENGTH                  0x00000001

#define _G1ACTDA_ACTPIX3_POSITION                0x00000003
#define _G1ACTDA_ACTPIX3_MASK                    0x00000008
#define _G1ACTDA_ACTPIX3_LENGTH                  0x00000001

#define _G1ACTDA_ACTPIX4_POSITION                0x00000004
#define _G1ACTDA_ACTPIX4_MASK                    0x00000010
#define _G1ACTDA_ACTPIX4_LENGTH                  0x00000001

#define _G1ACTDA_ACTPIX5_POSITION                0x00000005
#define _G1ACTDA_ACTPIX5_MASK                    0x00000020
#define _G1ACTDA_ACTPIX5_LENGTH                  0x00000001

#define _G1ACTDA_ACTPIX6_POSITION                0x00000006
#define _G1ACTDA_ACTPIX6_MASK                    0x00000040
#define _G1ACTDA_ACTPIX6_LENGTH                  0x00000001

#define _G1ACTDA_ACTPIX7_POSITION                0x00000007
#define _G1ACTDA_ACTPIX7_MASK                    0x00000080
#define _G1ACTDA_ACTPIX7_LENGTH                  0x00000001

#define _G1ACTDA_ACTLINE0_POSITION               0x00000008
#define _G1ACTDA_ACTLINE0_MASK                   0x00000100
#define _G1ACTDA_ACTLINE0_LENGTH                 0x00000001

#define _G1ACTDA_ACTLINE1_POSITION               0x00000009
#define _G1ACTDA_ACTLINE1_MASK                   0x00000200
#define _G1ACTDA_ACTLINE1_LENGTH                 0x00000001

#define _G1ACTDA_ACTLINE2_POSITION               0x0000000A
#define _G1ACTDA_ACTLINE2_MASK                   0x00000400
#define _G1ACTDA_ACTLINE2_LENGTH                 0x00000001

#define _G1ACTDA_ACTLINE3_POSITION               0x0000000B
#define _G1ACTDA_ACTLINE3_MASK                   0x00000800
#define _G1ACTDA_ACTLINE3_LENGTH                 0x00000001

#define _G1ACTDA_ACTLINE4_POSITION               0x0000000C
#define _G1ACTDA_ACTLINE4_MASK                   0x00001000
#define _G1ACTDA_ACTLINE4_LENGTH                 0x00000001

#define _G1ACTDA_ACTLINE5_POSITION               0x0000000D
#define _G1ACTDA_ACTLINE5_MASK                   0x00002000
#define _G1ACTDA_ACTLINE5_LENGTH                 0x00000001

#define _G1ACTDA_ACTLINE6_POSITION               0x0000000E
#define _G1ACTDA_ACTLINE6_MASK                   0x00004000
#define _G1ACTDA_ACTLINE6_LENGTH                 0x00000001

#define _G1ACTDA_ACTLINE7_POSITION               0x0000000F
#define _G1ACTDA_ACTLINE7_MASK                   0x00008000
#define _G1ACTDA_ACTLINE7_LENGTH                 0x00000001

#define _G1HSYNC_HSST_POSITION                   0x00000000
#define _G1HSYNC_HSST_MASK                       0x000000FF
#define _G1HSYNC_HSST_LENGTH                     0x00000008

#define _G1HSYNC_HSLEN_POSITION                  0x00000008
#define _G1HSYNC_HSLEN_MASK                      0x0000FF00
#define _G1HSYNC_HSLEN_LENGTH                    0x00000008

#define _G1HSYNC_HSST0_POSITION                  0x00000000
#define _G1HSYNC_HSST0_MASK                      0x00000001
#define _G1HSYNC_HSST0_LENGTH                    0x00000001

#define _G1HSYNC_HSST1_POSITION                  0x00000001
#define _G1HSYNC_HSST1_MASK                      0x00000002
#define _G1HSYNC_HSST1_LENGTH                    0x00000001

#define _G1HSYNC_HSST2_POSITION                  0x00000002
#define _G1HSYNC_HSST2_MASK                      0x00000004
#define _G1HSYNC_HSST2_LENGTH                    0x00000001

#define _G1HSYNC_HSST3_POSITION                  0x00000003
#define _G1HSYNC_HSST3_MASK                      0x00000008
#define _G1HSYNC_HSST3_LENGTH                    0x00000001

#define _G1HSYNC_HSST4_POSITION                  0x00000004
#define _G1HSYNC_HSST4_MASK                      0x00000010
#define _G1HSYNC_HSST4_LENGTH                    0x00000001

#define _G1HSYNC_HSST5_POSITION                  0x00000005
#define _G1HSYNC_HSST5_MASK                      0x00000020
#define _G1HSYNC_HSST5_LENGTH                    0x00000001

#define _G1HSYNC_HSST6_POSITION                  0x00000006
#define _G1HSYNC_HSST6_MASK                      0x00000040
#define _G1HSYNC_HSST6_LENGTH                    0x00000001

#define _G1HSYNC_HSST7_POSITION                  0x00000007
#define _G1HSYNC_HSST7_MASK                      0x00000080
#define _G1HSYNC_HSST7_LENGTH                    0x00000001

#define _G1HSYNC_HSLEN0_POSITION                 0x00000008
#define _G1HSYNC_HSLEN0_MASK                     0x00000100
#define _G1HSYNC_HSLEN0_LENGTH                   0x00000001

#define _G1HSYNC_HSLEN1_POSITION                 0x00000009
#define _G1HSYNC_HSLEN1_MASK                     0x00000200
#define _G1HSYNC_HSLEN1_LENGTH                   0x00000001

#define _G1HSYNC_HSLEN2_POSITION                 0x0000000A
#define _G1HSYNC_HSLEN2_MASK                     0x00000400
#define _G1HSYNC_HSLEN2_LENGTH                   0x00000001

#define _G1HSYNC_HSLEN3_POSITION                 0x0000000B
#define _G1HSYNC_HSLEN3_MASK                     0x00000800
#define _G1HSYNC_HSLEN3_LENGTH                   0x00000001

#define _G1HSYNC_HSLEN4_POSITION                 0x0000000C
#define _G1HSYNC_HSLEN4_MASK                     0x00001000
#define _G1HSYNC_HSLEN4_LENGTH                   0x00000001

#define _G1HSYNC_HSLEN5_POSITION                 0x0000000D
#define _G1HSYNC_HSLEN5_MASK                     0x00002000
#define _G1HSYNC_HSLEN5_LENGTH                   0x00000001

#define _G1HSYNC_HSLEN6_POSITION                 0x0000000E
#define _G1HSYNC_HSLEN6_MASK                     0x00004000
#define _G1HSYNC_HSLEN6_LENGTH                   0x00000001

#define _G1HSYNC_HSLEN7_POSITION                 0x0000000F
#define _G1HSYNC_HSLEN7_MASK                     0x00008000
#define _G1HSYNC_HSLEN7_LENGTH                   0x00000001

#define _G1VSYNC_VSST_POSITION                   0x00000000
#define _G1VSYNC_VSST_MASK                       0x000000FF
#define _G1VSYNC_VSST_LENGTH                     0x00000008

