Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24FJ128DA210.h
#define _G1VSYNC_VSLEN_POSITION                  0x00000008
#define _G1VSYNC_VSLEN_MASK                      0x0000FF00
#define _G1VSYNC_VSLEN_LENGTH                    0x00000008

#define _G1VSYNC_VSST0_POSITION                  0x00000000
#define _G1VSYNC_VSST0_MASK                      0x00000001
#define _G1VSYNC_VSST0_LENGTH                    0x00000001

#define _G1VSYNC_VSST1_POSITION                  0x00000001
#define _G1VSYNC_VSST1_MASK                      0x00000002
#define _G1VSYNC_VSST1_LENGTH                    0x00000001

#define _G1VSYNC_VSST2_POSITION                  0x00000002
#define _G1VSYNC_VSST2_MASK                      0x00000004
#define _G1VSYNC_VSST2_LENGTH                    0x00000001

#define _G1VSYNC_VSST3_POSITION                  0x00000003
#define _G1VSYNC_VSST3_MASK                      0x00000008
#define _G1VSYNC_VSST3_LENGTH                    0x00000001

#define _G1VSYNC_VSST4_POSITION                  0x00000004
#define _G1VSYNC_VSST4_MASK                      0x00000010
#define _G1VSYNC_VSST4_LENGTH                    0x00000001

#define _G1VSYNC_VSST5_POSITION                  0x00000005
#define _G1VSYNC_VSST5_MASK                      0x00000020
#define _G1VSYNC_VSST5_LENGTH                    0x00000001

#define _G1VSYNC_VSST6_POSITION                  0x00000006
#define _G1VSYNC_VSST6_MASK                      0x00000040
#define _G1VSYNC_VSST6_LENGTH                    0x00000001

#define _G1VSYNC_VSST7_POSITION                  0x00000007
#define _G1VSYNC_VSST7_MASK                      0x00000080
#define _G1VSYNC_VSST7_LENGTH                    0x00000001

#define _G1VSYNC_VSLEN0_POSITION                 0x00000008
#define _G1VSYNC_VSLEN0_MASK                     0x00000100
#define _G1VSYNC_VSLEN0_LENGTH                   0x00000001

#define _G1VSYNC_VSLEN1_POSITION                 0x00000009
#define _G1VSYNC_VSLEN1_MASK                     0x00000200
#define _G1VSYNC_VSLEN1_LENGTH                   0x00000001

#define _G1VSYNC_VSLEN2_POSITION                 0x0000000A
#define _G1VSYNC_VSLEN2_MASK                     0x00000400
#define _G1VSYNC_VSLEN2_LENGTH                   0x00000001

#define _G1VSYNC_VSLEN3_POSITION                 0x0000000B
#define _G1VSYNC_VSLEN3_MASK                     0x00000800
#define _G1VSYNC_VSLEN3_LENGTH                   0x00000001

#define _G1VSYNC_VSLEN4_POSITION                 0x0000000C
#define _G1VSYNC_VSLEN4_MASK                     0x00001000
#define _G1VSYNC_VSLEN4_LENGTH                   0x00000001

#define _G1VSYNC_VSLEN5_POSITION                 0x0000000D
#define _G1VSYNC_VSLEN5_MASK                     0x00002000
#define _G1VSYNC_VSLEN5_LENGTH                   0x00000001

#define _G1VSYNC_VSLEN6_POSITION                 0x0000000E
#define _G1VSYNC_VSLEN6_MASK                     0x00004000
#define _G1VSYNC_VSLEN6_LENGTH                   0x00000001

#define _G1VSYNC_VSLEN7_POSITION                 0x0000000F
#define _G1VSYNC_VSLEN7_MASK                     0x00008000
#define _G1VSYNC_VSLEN7_LENGTH                   0x00000001

#define _G1DBLCON_HENST_POSITION                 0x00000000
#define _G1DBLCON_HENST_MASK                     0x000000FF
#define _G1DBLCON_HENST_LENGTH                   0x00000008

#define _G1DBLCON_VENST_POSITION                 0x00000008
#define _G1DBLCON_VENST_MASK                     0x0000FF00
#define _G1DBLCON_VENST_LENGTH                   0x00000008

#define _G1DBLCON_HENST0_POSITION                0x00000000
#define _G1DBLCON_HENST0_MASK                    0x00000001
#define _G1DBLCON_HENST0_LENGTH                  0x00000001

#define _G1DBLCON_HENST1_POSITION                0x00000001
#define _G1DBLCON_HENST1_MASK                    0x00000002
#define _G1DBLCON_HENST1_LENGTH                  0x00000001

#define _G1DBLCON_HENST2_POSITION                0x00000002
#define _G1DBLCON_HENST2_MASK                    0x00000004
#define _G1DBLCON_HENST2_LENGTH                  0x00000001

#define _G1DBLCON_HENST3_POSITION                0x00000003
#define _G1DBLCON_HENST3_MASK                    0x00000008
#define _G1DBLCON_HENST3_LENGTH                  0x00000001

#define _G1DBLCON_HENST4_POSITION                0x00000004
#define _G1DBLCON_HENST4_MASK                    0x00000010
#define _G1DBLCON_HENST4_LENGTH                  0x00000001

#define _G1DBLCON_HENST5_POSITION                0x00000005
#define _G1DBLCON_HENST5_MASK                    0x00000020
#define _G1DBLCON_HENST5_LENGTH                  0x00000001

#define _G1DBLCON_HENST6_POSITION                0x00000006
#define _G1DBLCON_HENST6_MASK                    0x00000040
#define _G1DBLCON_HENST6_LENGTH                  0x00000001

#define _G1DBLCON_HENST7_POSITION                0x00000007
#define _G1DBLCON_HENST7_MASK                    0x00000080
#define _G1DBLCON_HENST7_LENGTH                  0x00000001

#define _G1DBLCON_VENST0_POSITION                0x00000008
#define _G1DBLCON_VENST0_MASK                    0x00000100
#define _G1DBLCON_VENST0_LENGTH                  0x00000001

#define _G1DBLCON_VENST1_POSITION                0x00000009
#define _G1DBLCON_VENST1_MASK                    0x00000200
#define _G1DBLCON_VENST1_LENGTH                  0x00000001

#define _G1DBLCON_VENST2_POSITION                0x0000000A
#define _G1DBLCON_VENST2_MASK                    0x00000400
#define _G1DBLCON_VENST2_LENGTH                  0x00000001

#define _G1DBLCON_VENST3_POSITION                0x0000000B
#define _G1DBLCON_VENST3_MASK                    0x00000800
#define _G1DBLCON_VENST3_LENGTH                  0x00000001

#define _G1DBLCON_VENST4_POSITION                0x0000000C
#define _G1DBLCON_VENST4_MASK                    0x00001000
#define _G1DBLCON_VENST4_LENGTH                  0x00000001

#define _G1DBLCON_VENST5_POSITION                0x0000000D
#define _G1DBLCON_VENST5_MASK                    0x00002000
#define _G1DBLCON_VENST5_LENGTH                  0x00000001

#define _G1DBLCON_VENST6_POSITION                0x0000000E
#define _G1DBLCON_VENST6_MASK                    0x00004000
#define _G1DBLCON_VENST6_LENGTH                  0x00000001

#define _G1DBLCON_VENST7_POSITION                0x0000000F
#define _G1DBLCON_VENST7_MASK                    0x00008000
#define _G1DBLCON_VENST7_LENGTH                  0x00000001

#define _G1CLUT_CLUTADR_POSITION                 0x00000000
#define _G1CLUT_CLUTADR_MASK                     0x000000FF
#define _G1CLUT_CLUTADR_LENGTH                   0x00000008

